package lab2.task2;


import java.util.*;

public class UniversityGenerator {
    private Random rand;

    public UniversityGenerator(final int seed) {
        rand = new Random(seed);
    }

    private static final String[] poolFullName = {
            "Биченко Родіон Богуславович",
            "Приходько Княжослав Федорович",
            "Костельник Немир Левович",
            "Мурський Антоній Федорович",
            "Комарницький Іоанн Фролович",
            "Строцень Христофор Янович",
            "Лебідь Магаслав Радимович",
            "Штокалко Оримир Радимович",
            "Диковицький Лютобор Арсенович",
            "Королько Арсен Гордиславович",
            "Лесів Есфір Бажанович",
            "Булаєнко Шаміль Семенович",
            "Маковійчук Іларіон Володимирович",
            "Горинь Юліан Володимирович",
            "Богачевський Євстафій Глібович",
            "Затула Адам Мстиславович",
            "Мінченко Жадан Северинович",
            "Волошенюк Іларіон Полянович",
            "Кониський Живосил Світанович",
            "Кусень Мстивой Азарович",
            "Комісаренко Євлампій Максимович",
            "Горовенко Царук Азарович",
            "Стадницький Царко Ратиборович",
            "Плющ Миролюб Ратиборович",
            "Солдатенко Йозеф Янович",
            "Загоруйко Шаміль Тарасович",
            "Соломченко Остап Давидович",
            "Терентюк Чеслав Вікторович",
            "Шпара Дмитро Вадимович",
            "Шило Царук Тихонович",
            "Гайдабура Царук Глібович",
            "Чорноволенко Наслав Денисович",
            "Мухопад Царко Панасович",
            "Малий Непобор Борисович",
            "Валенко Свободан Йосипович",
            "Педан Йонас Максимович",
            "Дидик Красун Ростиславович",
            "Дубрівний Ладо Федорович",
            "Бублики Щастибог Юліанович",
            "Тіщенко Йонас Богуславович",
            "Бованенко Порфир Охримович",
            "Устименко Флор Ігорович",
            "Крупа Юрій Радимович",
            "Гайовий Мир Арсенович",
            "Бучма Світовид Владиславович",
            "Вірський Живослав Остапович",
            "Загнітко Щастибог Сарматович",
            "Антонів Устим Захарович",
            "Залюбовський Світолюб Адамович",
            "Санін Щастибог Русланович",

            "Апанович Інеса Милославівна",
            "Слабошпицька Наслава Романівна",
            "Загребельний Єпистимія Богуславівна",
            "Храплива Жозефіна Борисівна",
            "Дунець Щедра Гордиславівна",
            "Джус Шарлота Герасимівна",
            "Піддубна Параскевія Бажанівна",
            "Бобаль Гликерія Герасимівна",
            "Бращайко Шанетта Арсенівна",
            "Лисовець Федосія Антонівна",
            "Федечко Василина Пилипівна",
            "Павличко Млада Максимівна",
            "Мацура Секлетина Світанівна",
            "Червоній Тереза Юхимівна",
            "Проць Ріанна Борисівна",
            "Потапенко Інга Бажанівна",
            "Скрипниченко Євдокія Тихонівна",
            "Лавріна Ярина Гордиславівна",
            "Дущенко Парасковія Сарматівна",
            "Миколайчук Йосипа Іванівна",
            "Колос Гаїна Ярославівна",
            "Чухліб Харитина Йосипівна",
            "Стрельченко Дзвенислава Фролівна",
            "Загребельний Харитина Драганівна",
            "Гайдай Родослава Русланівна",
            "Вовк Фаїна Владиславівна",
            "Головатий Пелагія Тихонівна",
            "Татаренко Сосанна Панасівна",
            "Строцень Богуслава Романівна",
            "Заглада Божена Бажанівна",
            "Ваврик Ореста Омелянівна",
            "Демиденко Шанетта Драганівна",
            "Нечипоренко Варвара Соломонівна",
            "Слинько Чеслава Вітанівна",
            "Мосендзи Чеслава Янівна",
            "Волошенюк Улита Костянтинівна",
            "Горак Сонцедара Богуславівна",
            "Прокопчук Уляна Полянівна",
            "Назаркевич Еріка Адріанівна",
            "Німченко Ореста Олегівна",
            "Корбан Берта Омелянівна",
            "Довгалюк Мудролюба Тимурівна",
            "Підручна Харитя Світанівна",
            "Зеленяк Ігорина Ярославівна",
            "Червоній Жанна Бажанівна",
            "Яцькович Пистина Соломонівна",
            "Яловенко Фотина Омелянівна",
            "Слабченко Харита Романівна",
            "Петренко Катря Герасимівна",
            "Скочиляс Яромира Драганівна",
    };

    private static final String[] poolInstitute = {
            "ІАРД",
            "ІБІС",
            "ІГДГ",
            "ІГСН",
            "ІНЕМ",
            "ІЕСК",
            "ІКНІ",
            "ІКТА",
            "ІМІТ",
    };

    private static final Map<String, String[]> poolSpecialty = new HashMap<String, String[]>() {{
        put("ІАРД", new String[]{
                "Дизайн",
                "Архітектура та містобудування",
                "Образотворче мистецтво, декоративне мистецтво, реставрація"
        });
        put("ІБІС", new String[]{
                "Будівництво та цивільна інженерія",
                "Гідротехнічне будівництво, водна інженерія та водні технології",
                "Пожежна безпека",
        });
        put("ІГДГ", new String[]{
                "Геодезія та землеустрій",
                "Науки про Землю",
        });
        put("ІГСН", new String[]{
                "Музеєзнавство, пам’яткознавство",
                "Інформаційна, бібліотечна та архівна справа",
                "Міжнародні відносини, суспільні комунікації та регіональні студії",
                "Соціологія",
                "Соціальна робота"
        });
        put("ІНЕМ", new String[]{
                "Економіка (освітня програма «Економіка бізнесу»)",
                "Облік і оподаткування",
                "Менеджмент",
                "Маркетинг",
                "Міжнародні економічні відносини"
        });
        put("ІЕСК", new String[]{
                "Електроенергетика, електротехніка та електромеханіка",
                "Автоматизація і комп’ютерно-інтегровані технології",
                "Атомна енергетика",
                "Теплоенергетика"
        });
        put("ІКНІ", new String[]{
                "Філологія",
                "Інженерія програмного забезпечення",
                "Комп'ютерні науки",
                "Системний аналіз",
                "Інформаційні системи та технології"
        });
        put("ІКТА", new String[]{
                "Інформаційні технології",
                "Автоматизація та приладобудування"
        });
        put("ІМІТ", new String[]{
                "Прикладна механіка",
                "Матеріалознавство",
                "Галузеве машинобудування",
                "Металургія"
        });
    }};

/*    public Student generateStudent(final String nameGroup, final String specialty) {
        return new Student(poolFullName[rand.nextInt(poolFullName.length - 1)], specialty, nameGroup);
    }

    public Group generateGroup(final String nameGroup, final String nameInstitute) {
        final String spec = poolSpecialty.get(nameInstitute)[rand.nextInt(poolSpecialty.get(nameInstitute).length - 1)];

        final List<Student> students = new ArrayList<>();
        final int numberOfStudents = rand.nextInt(15, 25);
        for (int i = 0; i < numberOfStudents; i++) {
            students.add(generateStudent(nameGroup, spec));
        }
        return new Group(nameGroup, students, new ArrayList<>());
    }

    public Institute generateInstitute(final String nameInstitute) {
        final Institute institute = new Institute(nameInstitute);
        return institute;
    }

    public University generateUniversity(final String nameUniversity) {

        final List<Integer> indexInstituteList = new ArrayList<>();
        final int numberOfInstitute = rand.nextInt(3, 9);
        for (int i = 0; i < numberOfInstitute; i++) {
            int randIndex = rand.nextInt(poolInstitute.length - 1);
            while (indexInstituteList.contains(randIndex)) {
                randIndex = rand.nextInt(poolInstitute.length - 1);
            }
            indexInstituteList.add(randIndex);
        }

        final List<Institute> institutes = new ArrayList<>();
        for (final int index : indexInstituteList) {
            institutes.add(new Institute(poolInstitute[index]));
        }
        return new University(nameUniversity, institutes);
    }

    private class PoolInstitute {
        public String instituteName;
        public String[] specialties;

        public PoolInstitute(final String instituteName, final String[] specialties) {
            this.instituteName = instituteName;
            this.specialties = specialties;
        }
    }*/


//    private static final String[] poolSpecialty = {
//            Соціальна економіка, аналітика та управління
//            Управління проєктами
//            Управління фінансово-економічною безпекою
//            Управління житловими будинками та їхніми об’єднаннями
//            Бізнес-адміністрування: стратегічний розвиток та інновації
//            Адміністративний менеджмент
//    };
}
